; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 186965 1 1 3 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph2 - mode
	image0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(have_image Phenomenon8 spectrograph2)
	(have_image Star9 spectrograph2)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Planet13 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
6. (take_image satellite0 star9 instrument0 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 1 of 6
7. (turn_to satellite0 star10 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star10)
   goals met: 1 of 6
8. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 6
9. (turn_to satellite0 planet13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet13)
   goals met: 2 of 6
10. (take_image satellite0 planet13 instrument0 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 3 of 6
11. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 3 of 6
12. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 6
13. (turn_to satellite0 phenomenon8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 6
14. (take_image satellite0 phenomenon8 instrument0 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 5 of 6
15. (turn_to satellite0 phenomenon12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 6
16. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 6 of 6
